; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types room object robot gripper)
 (:predicates (p4 ?r - robot ?x - room)
 	      (p2 ?o - object ?x - room)
	      (p3 ?r - robot ?g - gripper)
	      (p1 ?r - robot ?o - object ?g - gripper))

   (:action a3
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (p4 ?r ?from))
       :effect (and  (p4 ?r ?to)
		     (not (p4 ?r ?from))))

   (:action a1
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (p2 ?obj ?room) (p4 ?r ?room) (p3 ?r ?g))
       :effect (and (p1 ?r ?obj ?g)
		    (not (p2 ?obj ?room)) 
		    (not (p3 ?r ?g))))

   (:action a2
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (p1 ?r ?obj ?g) (p4 ?r ?room))
       :effect (and (p2 ?obj ?room)
		    (p3 ?r ?g)
		    (not (p1 ?r ?obj ?g)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects o3 - robot
o7 o8 - gripper
o10 o1 o6 o4 - room
o5 o2 o9 - object)
(:init
(p4 o3 o10)
(p3 o3 o7)
(p3 o3 o8)
(p2 o5 o6)
(p2 o2 o4)
(p2 o9 o1)
)
(:goal
(and
(p2 o5 o1)
(p2 o2 o1)
(p2 o9 o10)
)
)

(:constraints
  (always (forall (?b - object)
           (not (p1 o3 ?b o8))))
)
)

; plan
1. (a3 o3 o10 o1)
   deleted: (p4 o3 o10)
   added: (p4 o3 o1)
   goals met: 0 of 3
2. (a1 o3 o9 o1 o7)
   deleted: (p2 o9 o1) (p3 o3 o7)
   added: (p1 o3 o9 o7)
   goals met: 0 of 3
3. (a3 o3 o1 o10)
   deleted: (p4 o3 o1)
   added: (p4 o3 o10)
   goals met: 0 of 3
4. (a2 o3 o9 o10 o7)
   deleted: (p1 o3 o9 o7)
   added: (p2 o9 o10) (p3 o3 o7)
   goals met: 1 of 3
5. (a3 o3 o10 o4)
   deleted: (p4 o3 o10)
   added: (p4 o3 o4)
   goals met: 1 of 3
6. (a1 o3 o2 o4 o7)
   deleted: (p2 o2 o4) (p3 o3 o7)
   added: (p1 o3 o2 o7)
   goals met: 1 of 3
7. (a3 o3 o4 o1)
   deleted: (p4 o3 o4)
   added: (p4 o3 o1)
   goals met: 1 of 3
8. (a2 o3 o2 o1 o7)
   deleted: (p1 o3 o2 o7)
   added: (p2 o2 o1) (p3 o3 o7)
   goals met: 2 of 3
9. (a3 o3 o1 o6)
   deleted: (p4 o3 o1)
   added: (p4 o3 o6)
   goals met: 2 of 3
10. (a1 o3 o5 o6 o7)
   deleted: (p2 o5 o6) (p3 o3 o7)
   added: (p1 o3 o5 o7)
   goals met: 2 of 3
11. (a3 o3 o6 o1)
   deleted: (p4 o3 o6)
   added: (p4 o3 o1)
   goals met: 2 of 3
12. (a2 o3 o5 o1 o7)
   deleted: (p1 o3 o5 o7)
   added: (p2 o5 o1) (p3 o3 o7)
   goals met: 3 of 3
